                                // Завдання 1  

let counter = 5;
let n = prompt(`ведіть Пароль, у вас є ${counter} спроб` , 'pasword');
const p = "pasword";
    while(n !== p)
    {
        if (n === null ){
            alert( `Значення не введено`);
        }
        else {
        if (counter > 1 ) {
            counter --;
            n = prompt(`Введіть Пароль. У Вас залишилось кількість спроб -  ${counter} ` , `pasword`);
        }
    else {
        alert( `Будь ласка спробуйте пізніше!`);
    }}
    }
   
alert( `Запрошуємо на сайт!`);

// в мене є по цьому питання.  чому коли Спроби завершені - alert( `Будь ласка спробуйте пізніше!`); , чи alert( `Значення не введено`), зациклюється на цьому повідомленні ?

